Revit 2027 API
BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecified Property
 Major direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarSystemDirectionNotSpecified { get; }
Public Shared ReadOnly Property RebarSystemDirectionNotSpecified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarSystemDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
static member RebarSystemDirectionNotSpecified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace